Revit 2024 API
BuiltInFailures.ColumnFailures Class
 Failures about Columns.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ColumnFailures
Visual Basic
Public NotInheritable Class ColumnFailures
Visual C++
public ref class ColumnFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ColumnFailures
See Also
BuiltInFailures.ColumnFailures Members
Autodesk.Revit.DB Namespace